app/controllers/members_controller.rb

INSERT INTO "members" ("name", "salary_per_year", "country", "currency", "tags", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    member = Member.new(permited_params)

    member.currency = fetch_currency[:parsed_response_body] if fetch_currency[:success]

    if member.save

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "name" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["name", "Natany Test 2"], ["updated_at", "2022-08-15 23:38:57.362719"], ["id", 6]]
---
  def update
    member = Member.find(params[:id])

    member.currency = fetch_currency[:parsed_response_body] if fetch_currency[:success]

    if member.update(permited_params)

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    member = Member.find_by_id(params[:id])

    if member.present?

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 6]]
---
  def destroy
    member = Member.find(params[:id])

    if member.destroy